Hyphen325/S24-319/MSPM0_ValvanoWare/MSPM0_ValvanoWare/inc/Dump.c
// Dump.c
// Your solution to ECE319K Lab 3 Spring 2024
// Author: Noah Graf
// Last Modified: 2/9/24


#include <ti/devices/msp/msp.h>
#include "../inc/Timer.h"
#define MAXBUF 50
uint32_t DataBuffer[MAXBUF];
uint32_t TimeBuffer[MAXBUF];
uint32_t DebugCnt; // 0 to MAXBUF (0 is empty, MAXBUF is full)

// *****Debug_Init******
// Initializes your index or pointer.
// Input: none
// Output:none
void Debug_Init(void){
// students write this for Lab 3
// This function should also initialize Timer G12, call TimerG12_Init.
    DebugCnt = 0;
    TimerG12_Init();
  
}

// *****Debug_Dump******
// Records one data and one time into the two arrays.
// Input: data is value to store in DataBuffer
// Output: 1 for success, 0 for failure (buffers full)
uint32_t Debug_Dump(uint32_t data){
// students write this for Lab 3
// The software simply reads TIMG12->COUNTERREGS.CTR to get the current time in bus cycles.

  uint32_t time = TIMG12->COUNTERREGS.CTR;

  if(DebugCnt >= 50){
        return 0;
  }

  DataBuffer[DebugCnt] = data;
  TimeBuffer[DebugCnt] = time;
  DebugCnt++;
  return 1; // success
}
// *****Debug_Dump2******
// Always record data and time on the first call to Debug_Dump2
// However, after the first call
//    Records one data and one time into the two arrays, only if the data is different from the previous call.
//    Do not record data or time if the data is the same as the data from the previous call
// Input: data is value to store in DataBuffer
// Output: 1 for success (saved or skipped), 0 for failure (buffers full)
uint32_t Debug_Dump2(uint32_t data){
// optional for Lab 3
// The software simply reads TIMG12->COUNTERREGS.CTR to get the current time in bus cycles.

  return 1; // success
}
// *****Debug_Period******
// Calculate period of the recorded data using mask
// Input: mask specifies which bit(s) to observe
// Output: period in bus cycles
// Period is defined as rising edge (low to high) to the next rising edge.
// Return 0 if there is not enough collected data to calculate period .
uint32_t Debug_Period(uint32_t mask){
// students write this for Lab 3
// This function should not alter the recorded data.
// AND each recorded data with mask,
//    if nonzero the signal is considered high.
//    if zero, the signal is considered low.
  uint32_t periodsum = 0;//total of all lengths of periods
  uint32_t periodtotal = 0;//total number of periods
  uint32_t previousedge = 0;//index of previous rising edge
  uint32_t firstcomplete = 0;//verifies whether the first rising edge has been found
  if(DebugCnt <= 1){//Return when not enough data
      return 0;
  }
  

  for(uint8_t i = 1;i<DebugCnt;i++){
      if(((DataBuffer[i]&mask) > 0) && (DataBuffer[i-1]&mask) == 0){
          if(firstcomplete > 0){
              periodsum+= (TimeBuffer[previousedge]-TimeBuffer[i]);//Adds time difference between current rising edge and pervious one

              previousedge = i;//sets the last rising edge to the current index
              periodtotal++;
          }else{
              firstcomplete = 1;//if first rising edge doesnt do the calculation and just sets the edge
              previousedge = i;
          }
      }
  }
  if(periodtotal < 0){//ensures it doesnt / by 0
      return 0;
  }
  return periodsum/periodtotal;



}


// *****Debug_Duty******
// Calculate duty cycle of the recorded data using mask
// Input: mask specifies which bit(s) to observe
// Output: period in percent (0 to 100)
// Period is defined as rising edge (low to high) to the next rising edge.
// High is defined as rising edge (low to high) to the next falling edge.
// Duty cycle is (100*High)/Period
// Return 0 if there is not enough collected data to calculate duty cycle.
uint32_t Debug_Duty(uint32_t mask){
// optional for Lab 3
// This function should not alter the recorded data.
// AND each recorded data with mask,
//    if nonzero the signal is considered high.
//    if zero, the signal is considered low.
    uint32_t counter =0, difference=0, total=0, index=0, rising=0,falling=0,first_time = 0;
    while(index < 50){
        while((DataBuffer[index]&mask) == 0){
            index++;
            if(index >= 50 && counter > 0){
                return total/counter;
            }else if(index >=50 && counter ==0){
                return 0;
            }

        }
        if(index > 0 && first_time > 0){
            difference = rising-TimeBuffer[index];
            total += (100*falling)/difference;

            rising = TimeBuffer[index];
            counter++;
        }else if(index > 0 && first_time == 0){
            rising = TimeBuffer[index];
            first_time++;
        }

        while((DataBuffer[index]&mask) > 0){
            index++;
            if (index >= 50 && counter>0){
                return total/counter;
            }else if(index >=50 && counter ==0){
                return 0;
            }

        }
        if(first_time >0){
            falling = rising - TimeBuffer[index];

        }


    }
    return 0;

}

// Lab2 specific debugging code
uint32_t Theperiod;
uint32_t Theduty;
void Dump(void){
  uint32_t out = GPIOB->DOUT31_0&0x0070000; // PB18-PB16 outputs
  uint32_t in = GPIOB->DIN31_0&0x0F;        // PB3-PB0 inputs
  uint32_t data = out|in;                   // PB18-PB16, PB3-PB0
  uint32_t result = Debug_Dump(data);       // calls your Lab3 function
  if(result == 0){ // 0 means full
    Theperiod = Debug_Period(1<<17);// calls your Lab3 function
    Theduty = Debug_Duty(1<<17);
//   __asm volatile("bkpt; \n"); // breakpoint here
// observe Theperiod
  }
}




